# Homework 5 (10.29)

### 2023级  10222140402  吕欣萌

0.所有的题目结果中，给出SQL语句和执行结果。

In [15]:
import mysql.connector

# 连接到MySQL服务器
connection = mysql.connector.connect(
    host="localhost",
    user="root",
    password="13732875168Lxm" #替换为你的密码 
)

cursor = connection.cursor()
cursor.execute("CREATE DATABASE IF NOT EXISTS qing")
cursor.execute("USE qing")

1.在新数据库中新建一张 user 表,插入几条数据,属性包含:唯一标识(id),姓名(name)性别(sex).年龄(age).联系方式(phone)，数据如下：

('John Doe', 'Male', 25, '123-456-7890')

('Jane Smith', 'Female', 31, '987-654-3210')

('Bob Johnson', 'Male', 22, '555-123-4567')

In [16]:
# 删除表的 SQL 语句
cursor.execute("DROP TABLE IF EXISTS user,score,team;");

In [17]:
# 创建 user 表
sql = """
CREATE TABLE IF NOT EXISTS user (
    id INT PRIMARY KEY,
    name VARCHAR(255),
    sex VARCHAR(10),
    age INT,
    phone VARCHAR(20)
);
"""
cursor.execute(sql)

# 插入数据
insert_data_query = """
INSERT INTO user (id, name, sex, age, phone) VALUES
    (1, 'John Doe', 'Male', 25, '123-456-7890'),
    (2, 'Jane Smith', 'Female', 31, '987-654-3210'),
    (3, 'Bob Johnson', 'Male', 22, '555-123-4567'),
    (4, 'Taylor Swift', 'Female', 17, '555-123-4568');
"""
cursor.execute(insert_data_query)

select_query = "SELECT * FROM user;"
cursor.execute(select_query)

results = cursor.fetchall()
for row in results:
    print(row)

(1, 'John Doe', 'Male', 25, '123-456-7890')
(2, 'Jane Smith', 'Female', 31, '987-654-3210')
(3, 'Bob Johnson', 'Male', 22, '555-123-4567')
(4, 'Taylor Swift', 'Female', 17, '555-123-4568')

2.写出 SQL语句,查询 user 表中所有年龄在 20-30 范围内的用户。

In [18]:
# 查询年龄在 20 - 30 范围内的用户 SQL 语句
select_query = "SELECT * FROM user WHERE age BETWEEN 20 AND 30;"
cursor.execute(select_query)
results = cursor.fetchall()
for row in results:
    print(row)

(1, 'John Doe', 'Male', 25, '123-456-7890')
(3, 'Bob Johnson', 'Male', 22, '555-123-4567')

3.写出SQL语句，向user表中添加自己的个人信息，并添加几条和你姓名同姓的虚拟信息。

In [19]:
new_insert_query = """
INSERT INTO user (id, name, sex, age, phone) VALUES
    (5, 'Lv Xinmeng', 'Female', 21, '598-154-1458'),
    (6, 'Lv Buwei', 'Male', 35, '996-112-4815'),
    (7, 'Lvzhi', 'Female', 28, '457-123-7889'),
    (8, 'Lvyi', 'Female', 19, '152-123-4545');
"""
cursor.execute(new_insert_query)

# 查询并打印全部数据
select_all_query = "SELECT * FROM user;"
cursor.execute(select_all_query)
results = cursor.fetchall()
for row in results:
    print(row)

(1, 'John Doe', 'Male', 25, '123-456-7890')
(2, 'Jane Smith', 'Female', 31, '987-654-3210')
(3, 'Bob Johnson', 'Male', 22, '555-123-4567')
(4, 'Taylor Swift', 'Female', 17, '555-123-4568')
(5, 'Lv Xinmeng', 'Female', 21, '598-154-1458')
(6, 'Lv Buwei', 'Male', 35, '996-112-4815')
(7, 'Lvzhi', 'Female', 28, '457-123-7889')
(8, 'Lvyi', 'Female', 19, '152-123-4545')

4.写出 SQL语句,查询 user 表中年龄在 20-30 范围内,名字包含“你的姓氏”的用户,并按照年龄从大到小排序输出。

In [20]:
sql_query = """
SELECT * FROM user 
WHERE age BETWEEN 20 AND 30 AND name LIKE '%Lv%' 
ORDER BY age DESC;
"""
cursor.execute(sql_query)
results = cursor.fetchall()
for row in results:
    print(row)

(7, 'Lvzhi', 'Female', 28, '457-123-7889')
(5, 'Lv Xinmeng', 'Female', 21, '598-154-1458')

5.写出 SQL 语句,计算 user 表中所有用户的平均年龄。

In [21]:
sql_query = "SELECT AVG(age) FROM user;"
cursor.execute(sql_query)
result = cursor.fetchone()
if result:
    print(f"平均年龄为：{result[0]}")

平均年龄为：24.7500

6.新建两张表team 表(id,teamName)和score 表(id,teamid,userid,score)。其中score 表中的 teamid 为指向 team表id 的外键，userid 为指向 user表id的外键。

In [22]:
# 创建 team 表
create_team_table_query = """
CREATE TABLE team (
    id INT AUTO_INCREMENT PRIMARY KEY,
    teamName VARCHAR(255)
);
"""
cursor.execute(create_team_table_query)

# 创建 score 表，并设置外键约束
create_score_table_query = """
CREATE TABLE score (
    id INT AUTO_INCREMENT PRIMARY KEY,
    teamid INT,
    userid INT,
    score INT,
    FOREIGN KEY (teamid) REFERENCES team(id),
    FOREIGN KEY (userid) REFERENCES user(id)
);
"""
cursor.execute(create_score_table_query)

7.在team表中和score表中插入合适的记录，写出 SQL语句,查询 teamName 为“ECNU”的队伍中，年龄小于 20 的用户们，结果不得为空。

In [23]:
# 插入多条 team 表记录
insert_team_query = "INSERT INTO team (teamName) VALUES ('ECNU'), ('AnotherTeam');"
cursor.execute(insert_team_query)

# 插入多条 score 表记录，假设已有合适的用户记录在 user 表中
insert_score_query = """
INSERT INTO score (teamid, userid, score) VALUES
    (1, 7, 85),
    (1, 8, 90),
    (2, 5, 78),
    (2, 6, 82);
"""
cursor.execute(insert_score_query)

# 查询 teamName 为“ECNU”的队伍中，年龄小于 20 的用户们
query = """
SELECT u.*
FROM user u
JOIN score s ON u.id = s.userid
JOIN team t ON t.id = s.teamid
WHERE t.teamName = 'ECNU' AND u.age < 20;
"""
cursor.execute(query)
results = cursor.fetchall()
if results:
    for row in results:
        print(row)
else:
    print("没有满足条件的记录")

(8, 'Lvyi', 'Female', 19, '152-123-4545')

8.写出 SQL 语句,计算 teamName为“ECNU”的总分(假设 score 存在 null值,nul值默认为 0 加入计算)。

In [24]:
# 查询 teamName 为“ECNU”的总分
query = """
SELECT SUM(COALESCE(s.score, 0)) AS total_score
FROM team t
JOIN score s ON t.id = s.teamid
WHERE t.teamName = 'ECNU';
"""
cursor.execute(query)
result = cursor.fetchone()
if result and result[0] is not None:
    print(f"ECNU 的总分为：{result[0]}")
else:
    print("没有找到 ECNU 的总分信息")

ECNU 的总分为：175

9.写出SQL语句，删除user表中个人信息的记录。

In [26]:
# 临时关闭外键检查
cursor.execute("SET FOREIGN_KEY_CHECKS=0;")

# 假设删除名字为'Lv Buwei'的记录
delete_query = "DELETE FROM user WHERE name = 'Lv Xinmeng';"
cursor.execute(delete_query)

# 恢复外键检查
cursor.execute("SET FOREIGN_KEY_CHECKS=1;")

# 查询并打印剩余的记录
select_all_query = "SELECT * FROM user;"
cursor.execute(select_all_query)
results = cursor.fetchall()
for row in results:
    print(row)

(1, 'John Doe', 'Male', 25, '123-456-7890')
(2, 'Jane Smith', 'Female', 31, '987-654-3210')
(3, 'Bob Johnson', 'Male', 22, '555-123-4567')
(4, 'Taylor Swift', 'Female', 17, '555-123-4568')
(6, 'Lv Buwei', 'Male', 35, '996-112-4815')
(7, 'Lvzhi', 'Female', 28, '457-123-7889')
(8, 'Lvyi', 'Female', 19, '152-123-4545')

In [27]:
# 关闭连接
connection.close()